{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of13.bin", "group1-shard2of13.bin", "group1-shard3of13.bin", "group1-shard4of13.bin", "group1-shard5of13.bin", "group1-shard6of13.bin", "group1-shard7of13.bin", "group1-shard8of13.bin", "group1-shard9of13.bin", "group1-shard10of13.bin", "group1-shard11of13.bin", "group1-shard12of13.bin", "group1-shard13of13.bin"], "weights": [{"name": "stem_conv_1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "stem_bn_1/gamma", "shape": [32], "dtype": "float32"}, {"name": "stem_bn_1/beta", "shape": [32], "dtype": "float32"}, {"name": "stem_bn_1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "stem_bn_1/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block1a_dwconv_1/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "block1a_bn_1/gamma", "shape": [32], "dtype": "float32"}, {"name": "block1a_bn_1/beta", "shape": [32], "dtype": "float32"}, {"name": "block1a_bn_1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block1a_bn_1/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block1a_se_reduce_1/kernel", "shape": [1, 1, 32, 8], "dtype": "float32"}, {"name": "block1a_se_reduce_1/bias", "shape": [8], "dtype": "float32"}, {"name": "block1a_se_expand_1/kernel", "shape": [1, 1, 8, 32], "dtype": "float32"}, {"name": "block1a_se_expand_1/bias", "shape": [32], "dtype": "float32"}, {"name": "block1a_project_conv_1/kernel", "shape": [1, 1, 32, 16], "dtype": "float32"}, {"name": "block1a_project_bn_1/gamma", "shape": [16], "dtype": "float32"}, {"name": "block1a_project_bn_1/beta", "shape": [16], "dtype": "float32"}, {"name": "block1a_project_bn_1/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "block1a_project_bn_1/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "block1b_dwconv_1/depthwise_kernel", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "block1b_bn_1/gamma", "shape": [16], "dtype": "float32"}, {"name": "block1b_bn_1/beta", "shape": [16], "dtype": "float32"}, {"name": "block1b_bn_1/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "block1b_bn_1/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "block1b_se_reduce_1/kernel", "shape": [1, 1, 16, 4], "dtype": "float32"}, {"name": "block1b_se_reduce_1/bias", "shape": [4], "dtype": "float32"}, {"name": "block1b_se_expand_1/kernel", "shape": [1, 1, 4, 16], "dtype": "float32"}, {"name": "block1b_se_expand_1/bias", "shape": [16], "dtype": "float32"}, {"name": "block1b_project_conv_1/kernel", "shape": [1, 1, 16, 16], "dtype": "float32"}, {"name": "block1b_project_bn_1/gamma", "shape": [16], "dtype": "float32"}, {"name": "block1b_project_bn_1/beta", "shape": [16], "dtype": "float32"}, {"name": "block1b_project_bn_1/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "block1b_project_bn_1/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "block2a_expand_conv_1/kernel", "shape": [1, 1, 16, 96], "dtype": "float32"}, {"name": "block2a_expand_bn_1/gamma", "shape": [96], "dtype": "float32"}, {"name": "block2a_expand_bn_1/beta", "shape": [96], "dtype": "float32"}, {"name": "block2a_expand_bn_1/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block2a_expand_bn_1/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block2a_dwconv_1/depthwise_kernel", "shape": [3, 3, 96, 1], "dtype": "float32"}, {"name": "block2a_bn_1/gamma", "shape": [96], "dtype": "float32"}, {"name": "block2a_bn_1/beta", "shape": [96], "dtype": "float32"}, {"name": "block2a_bn_1/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block2a_bn_1/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block2a_se_reduce_1/kernel", "shape": [1, 1, 96, 4], "dtype": "float32"}, {"name": "block2a_se_reduce_1/bias", "shape": [4], "dtype": "float32"}, {"name": "block2a_se_expand_1/kernel", "shape": [1, 1, 4, 96], "dtype": "float32"}, {"name": "block2a_se_expand_1/bias", "shape": [96], "dtype": "float32"}, {"name": "block2a_project_conv_1/kernel", "shape": [1, 1, 96, 24], "dtype": "float32"}, {"name": "block2a_project_bn_1/gamma", "shape": [24], "dtype": "float32"}, {"name": "block2a_project_bn_1/beta", "shape": [24], "dtype": "float32"}, {"name": "block2a_project_bn_1/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "block2a_project_bn_1/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "block2b_expand_conv_1/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "block2b_expand_bn_1/gamma", "shape": [144], "dtype": "float32"}, {"name": "block2b_expand_bn_1/beta", "shape": [144], "dtype": "float32"}, {"name": "block2b_expand_bn_1/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "block2b_expand_bn_1/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "block2b_dwconv_1/depthwise_kernel", "shape": [3, 3, 144, 1], "dtype": "float32"}, {"name": "block2b_bn_1/gamma", "shape": [144], "dtype": "float32"}, {"name": "block2b_bn_1/beta", "shape": [144], "dtype": "float32"}, {"name": "block2b_bn_1/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "block2b_bn_1/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "block2b_se_reduce_1/kernel", "shape": [1, 1, 144, 6], "dtype": "float32"}, {"name": "block2b_se_reduce_1/bias", "shape": [6], "dtype": "float32"}, {"name": "block2b_se_expand_1/kernel", "shape": [1, 1, 6, 144], "dtype": "float32"}, {"name": "block2b_se_expand_1/bias", "shape": [144], "dtype": "float32"}, {"name": "block2b_project_conv_1/kernel", "shape": [1, 1, 144, 24], "dtype": "float32"}, {"name": "block2b_project_bn_1/gamma", "shape": [24], "dtype": "float32"}, {"name": "block2b_project_bn_1/beta", "shape": [24], "dtype": "float32"}, {"name": "block2b_project_bn_1/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "block2b_project_bn_1/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "block2c_expand_conv_1/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "block2c_expand_bn_1/gamma", "shape": [144], "dtype": "float32"}, {"name": "block2c_expand_bn_1/beta", "shape": [144], "dtype": "float32"}, {"name": "block2c_expand_bn_1/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "block2c_expand_bn_1/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "block2c_dwconv_1/depthwise_kernel", "shape": [3, 3, 144, 1], "dtype": "float32"}, {"name": "block2c_bn_1/gamma", "shape": [144], "dtype": "float32"}, {"name": "block2c_bn_1/beta", "shape": [144], "dtype": "float32"}, {"name": "block2c_bn_1/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "block2c_bn_1/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "block2c_se_reduce_1/kernel", "shape": [1, 1, 144, 6], "dtype": "float32"}, {"name": "block2c_se_reduce_1/bias", "shape": [6], "dtype": "float32"}, {"name": "block2c_se_expand_1/kernel", "shape": [1, 1, 6, 144], "dtype": "float32"}, {"name": "block2c_se_expand_1/bias", "shape": [144], "dtype": "float32"}, {"name": "block2c_project_conv_1/kernel", "shape": [1, 1, 144, 24], "dtype": "float32"}, {"name": "block2c_project_bn_1/gamma", "shape": [24], "dtype": "float32"}, {"name": "block2c_project_bn_1/beta", "shape": [24], "dtype": "float32"}, {"name": "block2c_project_bn_1/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "block2c_project_bn_1/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "block3a_expand_conv_1/kernel", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "block3a_expand_bn_1/gamma", "shape": [144], "dtype": "float32"}, {"name": "block3a_expand_bn_1/beta", "shape": [144], "dtype": "float32"}, {"name": "block3a_expand_bn_1/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "block3a_expand_bn_1/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "block3a_dwconv_1/depthwise_kernel", "shape": [5, 5, 144, 1], "dtype": "float32"}, {"name": "block3a_bn_1/gamma", "shape": [144], "dtype": "float32"}, {"name": "block3a_bn_1/beta", "shape": [144], "dtype": "float32"}, {"name": "block3a_bn_1/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "block3a_bn_1/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "block3a_se_reduce_1/kernel", "shape": [1, 1, 144, 6], "dtype": "float32"}, {"name": "block3a_se_reduce_1/bias", "shape": [6], "dtype": "float32"}, {"name": "block3a_se_expand_1/kernel", "shape": [1, 1, 6, 144], "dtype": "float32"}, {"name": "block3a_se_expand_1/bias", "shape": [144], "dtype": "float32"}, {"name": "block3a_project_conv_1/kernel", "shape": [1, 1, 144, 40], "dtype": "float32"}, {"name": "block3a_project_bn_1/gamma", "shape": [40], "dtype": "float32"}, {"name": "block3a_project_bn_1/beta", "shape": [40], "dtype": "float32"}, {"name": "block3a_project_bn_1/moving_mean", "shape": [40], "dtype": "float32"}, {"name": "block3a_project_bn_1/moving_variance", "shape": [40], "dtype": "float32"}, {"name": "block3b_expand_conv_1/kernel", "shape": [1, 1, 40, 240], "dtype": "float32"}, {"name": "block3b_expand_bn_1/gamma", "shape": [240], "dtype": "float32"}, {"name": "block3b_expand_bn_1/beta", "shape": [240], "dtype": "float32"}, {"name": "block3b_expand_bn_1/moving_mean", "shape": [240], "dtype": "float32"}, {"name": "block3b_expand_bn_1/moving_variance", "shape": [240], "dtype": "float32"}, {"name": "block3b_dwconv_1/depthwise_kernel", "shape": [5, 5, 240, 1], "dtype": "float32"}, {"name": "block3b_bn_1/gamma", "shape": [240], "dtype": "float32"}, {"name": "block3b_bn_1/beta", "shape": [240], "dtype": "float32"}, {"name": "block3b_bn_1/moving_mean", "shape": [240], "dtype": "float32"}, {"name": "block3b_bn_1/moving_variance", "shape": [240], "dtype": "float32"}, {"name": "block3b_se_reduce_1/kernel", "shape": [1, 1, 240, 10], "dtype": "float32"}, {"name": "block3b_se_reduce_1/bias", "shape": [10], "dtype": "float32"}, {"name": "block3b_se_expand_1/kernel", "shape": [1, 1, 10, 240], "dtype": "float32"}, {"name": "block3b_se_expand_1/bias", "shape": [240], "dtype": "float32"}, {"name": "block3b_project_conv_1/kernel", "shape": [1, 1, 240, 40], "dtype": "float32"}, {"name": "block3b_project_bn_1/gamma", "shape": [40], "dtype": "float32"}, {"name": "block3b_project_bn_1/beta", "shape": [40], "dtype": "float32"}, {"name": "block3b_project_bn_1/moving_mean", "shape": [40], "dtype": "float32"}, {"name": "block3b_project_bn_1/moving_variance", "shape": [40], "dtype": "float32"}, {"name": "block3c_expand_conv_1/kernel", "shape": [1, 1, 40, 240], "dtype": "float32"}, {"name": "block3c_expand_bn_1/gamma", "shape": [240], "dtype": "float32"}, {"name": "block3c_expand_bn_1/beta", "shape": [240], "dtype": "float32"}, {"name": "block3c_expand_bn_1/moving_mean", "shape": [240], "dtype": "float32"}, {"name": "block3c_expand_bn_1/moving_variance", "shape": [240], "dtype": "float32"}, {"name": "block3c_dwconv_1/depthwise_kernel", "shape": [5, 5, 240, 1], "dtype": "float32"}, {"name": "block3c_bn_1/gamma", "shape": [240], "dtype": "float32"}, {"name": "block3c_bn_1/beta", "shape": [240], "dtype": "float32"}, {"name": "block3c_bn_1/moving_mean", "shape": [240], "dtype": "float32"}, {"name": "block3c_bn_1/moving_variance", "shape": [240], "dtype": "float32"}, {"name": "block3c_se_reduce_1/kernel", "shape": [1, 1, 240, 10], "dtype": "float32"}, {"name": "block3c_se_reduce_1/bias", "shape": [10], "dtype": "float32"}, {"name": "block3c_se_expand_1/kernel", "shape": [1, 1, 10, 240], "dtype": "float32"}, {"name": "block3c_se_expand_1/bias", "shape": [240], "dtype": "float32"}, {"name": "block3c_project_conv_1/kernel", "shape": [1, 1, 240, 40], "dtype": "float32"}, {"name": "block3c_project_bn_1/gamma", "shape": [40], "dtype": "float32"}, {"name": "block3c_project_bn_1/beta", "shape": [40], "dtype": "float32"}, {"name": "block3c_project_bn_1/moving_mean", "shape": [40], "dtype": "float32"}, {"name": "block3c_project_bn_1/moving_variance", "shape": [40], "dtype": "float32"}, {"name": "block4a_expand_conv_1/kernel", "shape": [1, 1, 40, 240], "dtype": "float32"}, {"name": "block4a_expand_bn_1/gamma", "shape": [240], "dtype": "float32"}, {"name": "block4a_expand_bn_1/beta", "shape": [240], "dtype": "float32"}, {"name": "block4a_expand_bn_1/moving_mean", "shape": [240], "dtype": "float32"}, {"name": "block4a_expand_bn_1/moving_variance", "shape": [240], "dtype": "float32"}, {"name": "block4a_dwconv_1/depthwise_kernel", "shape": [3, 3, 240, 1], "dtype": "float32"}, {"name": "block4a_bn_1/gamma", "shape": [240], "dtype": "float32"}, {"name": "block4a_bn_1/beta", "shape": [240], "dtype": "float32"}, {"name": "block4a_bn_1/moving_mean", "shape": [240], "dtype": "float32"}, {"name": "block4a_bn_1/moving_variance", "shape": [240], "dtype": "float32"}, {"name": "block4a_se_reduce_1/kernel", "shape": [1, 1, 240, 10], "dtype": "float32"}, {"name": "block4a_se_reduce_1/bias", "shape": [10], "dtype": "float32"}, {"name": "block4a_se_expand_1/kernel", "shape": [1, 1, 10, 240], "dtype": "float32"}, {"name": "block4a_se_expand_1/bias", "shape": [240], "dtype": "float32"}, {"name": "block4a_project_conv_1/kernel", "shape": [1, 1, 240, 80], "dtype": "float32"}, {"name": "block4a_project_bn_1/gamma", "shape": [80], "dtype": "float32"}, {"name": "block4a_project_bn_1/beta", "shape": [80], "dtype": "float32"}, {"name": "block4a_project_bn_1/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "block4a_project_bn_1/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "block4b_expand_conv_1/kernel", "shape": [1, 1, 80, 480], "dtype": "float32"}, {"name": "block4b_expand_bn_1/gamma", "shape": [480], "dtype": "float32"}, {"name": "block4b_expand_bn_1/beta", "shape": [480], "dtype": "float32"}, {"name": "block4b_expand_bn_1/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "block4b_expand_bn_1/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "block4b_dwconv_1/depthwise_kernel", "shape": [3, 3, 480, 1], "dtype": "float32"}, {"name": "block4b_bn_1/gamma", "shape": [480], "dtype": "float32"}, {"name": "block4b_bn_1/beta", "shape": [480], "dtype": "float32"}, {"name": "block4b_bn_1/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "block4b_bn_1/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "block4b_se_reduce_1/kernel", "shape": [1, 1, 480, 20], "dtype": "float32"}, {"name": "block4b_se_reduce_1/bias", "shape": [20], "dtype": "float32"}, {"name": "block4b_se_expand_1/kernel", "shape": [1, 1, 20, 480], "dtype": "float32"}, {"name": "block4b_se_expand_1/bias", "shape": [480], "dtype": "float32"}, {"name": "block4b_project_conv_1/kernel", "shape": [1, 1, 480, 80], "dtype": "float32"}, {"name": "block4b_project_bn_1/gamma", "shape": [80], "dtype": "float32"}, {"name": "block4b_project_bn_1/beta", "shape": [80], "dtype": "float32"}, {"name": "block4b_project_bn_1/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "block4b_project_bn_1/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "block4c_expand_conv_1/kernel", "shape": [1, 1, 80, 480], "dtype": "float32"}, {"name": "block4c_expand_bn_1/gamma", "shape": [480], "dtype": "float32"}, {"name": "block4c_expand_bn_1/beta", "shape": [480], "dtype": "float32"}, {"name": "block4c_expand_bn_1/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "block4c_expand_bn_1/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "block4c_dwconv_1/depthwise_kernel", "shape": [3, 3, 480, 1], "dtype": "float32"}, {"name": "block4c_bn_1/gamma", "shape": [480], "dtype": "float32"}, {"name": "block4c_bn_1/beta", "shape": [480], "dtype": "float32"}, {"name": "block4c_bn_1/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "block4c_bn_1/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "block4c_se_reduce_1/kernel", "shape": [1, 1, 480, 20], "dtype": "float32"}, {"name": "block4c_se_reduce_1/bias", "shape": [20], "dtype": "float32"}, {"name": "block4c_se_expand_1/kernel", "shape": [1, 1, 20, 480], "dtype": "float32"}, {"name": "block4c_se_expand_1/bias", "shape": [480], "dtype": "float32"}, {"name": "block4c_project_conv_1/kernel", "shape": [1, 1, 480, 80], "dtype": "float32"}, {"name": "block4c_project_bn_1/gamma", "shape": [80], "dtype": "float32"}, {"name": "block4c_project_bn_1/beta", "shape": [80], "dtype": "float32"}, {"name": "block4c_project_bn_1/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "block4c_project_bn_1/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "block4d_expand_conv_1/kernel", "shape": [1, 1, 80, 480], "dtype": "float32"}, {"name": "block4d_expand_bn_1/gamma", "shape": [480], "dtype": "float32"}, {"name": "block4d_expand_bn_1/beta", "shape": [480], "dtype": "float32"}, {"name": "block4d_expand_bn_1/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "block4d_expand_bn_1/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "block4d_dwconv_1/depthwise_kernel", "shape": [3, 3, 480, 1], "dtype": "float32"}, {"name": "block4d_bn_1/gamma", "shape": [480], "dtype": "float32"}, {"name": "block4d_bn_1/beta", "shape": [480], "dtype": "float32"}, {"name": "block4d_bn_1/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "block4d_bn_1/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "block4d_se_reduce_1/kernel", "shape": [1, 1, 480, 20], "dtype": "float32"}, {"name": "block4d_se_reduce_1/bias", "shape": [20], "dtype": "float32"}, {"name": "block4d_se_expand_1/kernel", "shape": [1, 1, 20, 480], "dtype": "float32"}, {"name": "block4d_se_expand_1/bias", "shape": [480], "dtype": "float32"}, {"name": "block4d_project_conv_1/kernel", "shape": [1, 1, 480, 80], "dtype": "float32"}, {"name": "block4d_project_bn_1/gamma", "shape": [80], "dtype": "float32"}, {"name": "block4d_project_bn_1/beta", "shape": [80], "dtype": "float32"}, {"name": "block4d_project_bn_1/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "block4d_project_bn_1/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "block5a_expand_conv_1/kernel", "shape": [1, 1, 80, 480], "dtype": "float32"}, {"name": "block5a_expand_bn_1/gamma", "shape": [480], "dtype": "float32"}, {"name": "block5a_expand_bn_1/beta", "shape": [480], "dtype": "float32"}, {"name": "block5a_expand_bn_1/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "block5a_expand_bn_1/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "block5a_dwconv_1/depthwise_kernel", "shape": [5, 5, 480, 1], "dtype": "float32"}, {"name": "block5a_bn_1/gamma", "shape": [480], "dtype": "float32"}, {"name": "block5a_bn_1/beta", "shape": [480], "dtype": "float32"}, {"name": "block5a_bn_1/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "block5a_bn_1/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "block5a_se_reduce_1/kernel", "shape": [1, 1, 480, 20], "dtype": "float32"}, {"name": "block5a_se_reduce_1/bias", "shape": [20], "dtype": "float32"}, {"name": "block5a_se_expand_1/kernel", "shape": [1, 1, 20, 480], "dtype": "float32"}, {"name": "block5a_se_expand_1/bias", "shape": [480], "dtype": "float32"}, {"name": "block5a_project_conv_1/kernel", "shape": [1, 1, 480, 112], "dtype": "float32"}, {"name": "block5a_project_bn_1/gamma", "shape": [112], "dtype": "float32"}, {"name": "block5a_project_bn_1/beta", "shape": [112], "dtype": "float32"}, {"name": "block5a_project_bn_1/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "block5a_project_bn_1/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "block5b_expand_conv_1/kernel", "shape": [1, 1, 112, 672], "dtype": "float32"}, {"name": "block5b_expand_bn_1/gamma", "shape": [672], "dtype": "float32"}, {"name": "block5b_expand_bn_1/beta", "shape": [672], "dtype": "float32"}, {"name": "block5b_expand_bn_1/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "block5b_expand_bn_1/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "block5b_dwconv_1/depthwise_kernel", "shape": [5, 5, 672, 1], "dtype": "float32"}, {"name": "block5b_bn_1/gamma", "shape": [672], "dtype": "float32"}, {"name": "block5b_bn_1/beta", "shape": [672], "dtype": "float32"}, {"name": "block5b_bn_1/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "block5b_bn_1/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "block5b_se_reduce_1/kernel", "shape": [1, 1, 672, 28], "dtype": "float32"}, {"name": "block5b_se_reduce_1/bias", "shape": [28], "dtype": "float32"}, {"name": "block5b_se_expand_1/kernel", "shape": [1, 1, 28, 672], "dtype": "float32"}, {"name": "block5b_se_expand_1/bias", "shape": [672], "dtype": "float32"}, {"name": "block5b_project_conv_1/kernel", "shape": [1, 1, 672, 112], "dtype": "float32"}, {"name": "block5b_project_bn_1/gamma", "shape": [112], "dtype": "float32"}, {"name": "block5b_project_bn_1/beta", "shape": [112], "dtype": "float32"}, {"name": "block5b_project_bn_1/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "block5b_project_bn_1/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "block5c_expand_conv_1/kernel", "shape": [1, 1, 112, 672], "dtype": "float32"}, {"name": "block5c_expand_bn_1/gamma", "shape": [672], "dtype": "float32"}, {"name": "block5c_expand_bn_1/beta", "shape": [672], "dtype": "float32"}, {"name": "block5c_expand_bn_1/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "block5c_expand_bn_1/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "block5c_dwconv_1/depthwise_kernel", "shape": [5, 5, 672, 1], "dtype": "float32"}, {"name": "block5c_bn_1/gamma", "shape": [672], "dtype": "float32"}, {"name": "block5c_bn_1/beta", "shape": [672], "dtype": "float32"}, {"name": "block5c_bn_1/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "block5c_bn_1/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "block5c_se_reduce_1/kernel", "shape": [1, 1, 672, 28], "dtype": "float32"}, {"name": "block5c_se_reduce_1/bias", "shape": [28], "dtype": "float32"}, {"name": "block5c_se_expand_1/kernel", "shape": [1, 1, 28, 672], "dtype": "float32"}, {"name": "block5c_se_expand_1/bias", "shape": [672], "dtype": "float32"}, {"name": "block5c_project_conv_1/kernel", "shape": [1, 1, 672, 112], "dtype": "float32"}, {"name": "block5c_project_bn_1/gamma", "shape": [112], "dtype": "float32"}, {"name": "block5c_project_bn_1/beta", "shape": [112], "dtype": "float32"}, {"name": "block5c_project_bn_1/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "block5c_project_bn_1/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "block5d_expand_conv_1/kernel", "shape": [1, 1, 112, 672], "dtype": "float32"}, {"name": "block5d_expand_bn_1/gamma", "shape": [672], "dtype": "float32"}, {"name": "block5d_expand_bn_1/beta", "shape": [672], "dtype": "float32"}, {"name": "block5d_expand_bn_1/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "block5d_expand_bn_1/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "block5d_dwconv_1/depthwise_kernel", "shape": [5, 5, 672, 1], "dtype": "float32"}, {"name": "block5d_bn_1/gamma", "shape": [672], "dtype": "float32"}, {"name": "block5d_bn_1/beta", "shape": [672], "dtype": "float32"}, {"name": "block5d_bn_1/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "block5d_bn_1/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "block5d_se_reduce_1/kernel", "shape": [1, 1, 672, 28], "dtype": "float32"}, {"name": "block5d_se_reduce_1/bias", "shape": [28], "dtype": "float32"}, {"name": "block5d_se_expand_1/kernel", "shape": [1, 1, 28, 672], "dtype": "float32"}, {"name": "block5d_se_expand_1/bias", "shape": [672], "dtype": "float32"}, {"name": "block5d_project_conv_1/kernel", "shape": [1, 1, 672, 112], "dtype": "float32"}, {"name": "block5d_project_bn_1/gamma", "shape": [112], "dtype": "float32"}, {"name": "block5d_project_bn_1/beta", "shape": [112], "dtype": "float32"}, {"name": "block5d_project_bn_1/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "block5d_project_bn_1/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "block6a_expand_conv_1/kernel", "shape": [1, 1, 112, 672], "dtype": "float32"}, {"name": "block6a_expand_bn_1/gamma", "shape": [672], "dtype": "float32"}, {"name": "block6a_expand_bn_1/beta", "shape": [672], "dtype": "float32"}, {"name": "block6a_expand_bn_1/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "block6a_expand_bn_1/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "block6a_dwconv_1/depthwise_kernel", "shape": [5, 5, 672, 1], "dtype": "float32"}, {"name": "block6a_bn_1/gamma", "shape": [672], "dtype": "float32"}, {"name": "block6a_bn_1/beta", "shape": [672], "dtype": "float32"}, {"name": "block6a_bn_1/moving_mean", "shape": [672], "dtype": "float32"}, {"name": "block6a_bn_1/moving_variance", "shape": [672], "dtype": "float32"}, {"name": "block6a_se_reduce_1/kernel", "shape": [1, 1, 672, 28], "dtype": "float32"}, {"name": "block6a_se_reduce_1/bias", "shape": [28], "dtype": "float32"}, {"name": "block6a_se_expand_1/kernel", "shape": [1, 1, 28, 672], "dtype": "float32"}, {"name": "block6a_se_expand_1/bias", "shape": [672], "dtype": "float32"}, {"name": "block6a_project_conv_1/kernel", "shape": [1, 1, 672, 192], "dtype": "float32"}, {"name": "block6a_project_bn_1/gamma", "shape": [192], "dtype": "float32"}, {"name": "block6a_project_bn_1/beta", "shape": [192], "dtype": "float32"}, {"name": "block6a_project_bn_1/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block6a_project_bn_1/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block6b_expand_conv_1/kernel", "shape": [1, 1, 192, 1152], "dtype": "float32"}, {"name": "block6b_expand_bn_1/gamma", "shape": [1152], "dtype": "float32"}, {"name": "block6b_expand_bn_1/beta", "shape": [1152], "dtype": "float32"}, {"name": "block6b_expand_bn_1/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "block6b_expand_bn_1/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "block6b_dwconv_1/depthwise_kernel", "shape": [5, 5, 1152, 1], "dtype": "float32"}, {"name": "block6b_bn_1/gamma", "shape": [1152], "dtype": "float32"}, {"name": "block6b_bn_1/beta", "shape": [1152], "dtype": "float32"}, {"name": "block6b_bn_1/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "block6b_bn_1/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "block6b_se_reduce_1/kernel", "shape": [1, 1, 1152, 48], "dtype": "float32"}, {"name": "block6b_se_reduce_1/bias", "shape": [48], "dtype": "float32"}, {"name": "block6b_se_expand_1/kernel", "shape": [1, 1, 48, 1152], "dtype": "float32"}, {"name": "block6b_se_expand_1/bias", "shape": [1152], "dtype": "float32"}, {"name": "block6b_project_conv_1/kernel", "shape": [1, 1, 1152, 192], "dtype": "float32"}, {"name": "block6b_project_bn_1/gamma", "shape": [192], "dtype": "float32"}, {"name": "block6b_project_bn_1/beta", "shape": [192], "dtype": "float32"}, {"name": "block6b_project_bn_1/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block6b_project_bn_1/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block6c_expand_conv_1/kernel", "shape": [1, 1, 192, 1152], "dtype": "float32"}, {"name": "block6c_expand_bn_1/gamma", "shape": [1152], "dtype": "float32"}, {"name": "block6c_expand_bn_1/beta", "shape": [1152], "dtype": "float32"}, {"name": "block6c_expand_bn_1/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "block6c_expand_bn_1/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "block6c_dwconv_1/depthwise_kernel", "shape": [5, 5, 1152, 1], "dtype": "float32"}, {"name": "block6c_bn_1/gamma", "shape": [1152], "dtype": "float32"}, {"name": "block6c_bn_1/beta", "shape": [1152], "dtype": "float32"}, {"name": "block6c_bn_1/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "block6c_bn_1/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "block6c_se_reduce_1/kernel", "shape": [1, 1, 1152, 48], "dtype": "float32"}, {"name": "block6c_se_reduce_1/bias", "shape": [48], "dtype": "float32"}, {"name": "block6c_se_expand_1/kernel", "shape": [1, 1, 48, 1152], "dtype": "float32"}, {"name": "block6c_se_expand_1/bias", "shape": [1152], "dtype": "float32"}, {"name": "block6c_project_conv_1/kernel", "shape": [1, 1, 1152, 192], "dtype": "float32"}, {"name": "block6c_project_bn_1/gamma", "shape": [192], "dtype": "float32"}, {"name": "block6c_project_bn_1/beta", "shape": [192], "dtype": "float32"}, {"name": "block6c_project_bn_1/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block6c_project_bn_1/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block6d_expand_conv_1/kernel", "shape": [1, 1, 192, 1152], "dtype": "float32"}, {"name": "block6d_expand_bn_1/gamma", "shape": [1152], "dtype": "float32"}, {"name": "block6d_expand_bn_1/beta", "shape": [1152], "dtype": "float32"}, {"name": "block6d_expand_bn_1/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "block6d_expand_bn_1/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "block6d_dwconv_1/depthwise_kernel", "shape": [5, 5, 1152, 1], "dtype": "float32"}, {"name": "block6d_bn_1/gamma", "shape": [1152], "dtype": "float32"}, {"name": "block6d_bn_1/beta", "shape": [1152], "dtype": "float32"}, {"name": "block6d_bn_1/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "block6d_bn_1/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "block6d_se_reduce_1/kernel", "shape": [1, 1, 1152, 48], "dtype": "float32"}, {"name": "block6d_se_reduce_1/bias", "shape": [48], "dtype": "float32"}, {"name": "block6d_se_expand_1/kernel", "shape": [1, 1, 48, 1152], "dtype": "float32"}, {"name": "block6d_se_expand_1/bias", "shape": [1152], "dtype": "float32"}, {"name": "block6d_project_conv_1/kernel", "shape": [1, 1, 1152, 192], "dtype": "float32"}, {"name": "block6d_project_bn_1/gamma", "shape": [192], "dtype": "float32"}, {"name": "block6d_project_bn_1/beta", "shape": [192], "dtype": "float32"}, {"name": "block6d_project_bn_1/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block6d_project_bn_1/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block6e_expand_conv_1/kernel", "shape": [1, 1, 192, 1152], "dtype": "float32"}, {"name": "block6e_expand_bn_1/gamma", "shape": [1152], "dtype": "float32"}, {"name": "block6e_expand_bn_1/beta", "shape": [1152], "dtype": "float32"}, {"name": "block6e_expand_bn_1/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "block6e_expand_bn_1/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "block6e_dwconv_1/depthwise_kernel", "shape": [5, 5, 1152, 1], "dtype": "float32"}, {"name": "block6e_bn_1/gamma", "shape": [1152], "dtype": "float32"}, {"name": "block6e_bn_1/beta", "shape": [1152], "dtype": "float32"}, {"name": "block6e_bn_1/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "block6e_bn_1/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "block6e_se_reduce_1/kernel", "shape": [1, 1, 1152, 48], "dtype": "float32"}, {"name": "block6e_se_reduce_1/bias", "shape": [48], "dtype": "float32"}, {"name": "block6e_se_expand_1/kernel", "shape": [1, 1, 48, 1152], "dtype": "float32"}, {"name": "block6e_se_expand_1/bias", "shape": [1152], "dtype": "float32"}, {"name": "block6e_project_conv_1/kernel", "shape": [1, 1, 1152, 192], "dtype": "float32"}, {"name": "block6e_project_bn_1/gamma", "shape": [192], "dtype": "float32"}, {"name": "block6e_project_bn_1/beta", "shape": [192], "dtype": "float32"}, {"name": "block6e_project_bn_1/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block6e_project_bn_1/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block7a_expand_conv_1/kernel", "shape": [1, 1, 192, 1152], "dtype": "float32"}, {"name": "block7a_expand_bn_1/gamma", "shape": [1152], "dtype": "float32"}, {"name": "block7a_expand_bn_1/beta", "shape": [1152], "dtype": "float32"}, {"name": "block7a_expand_bn_1/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "block7a_expand_bn_1/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "block7a_dwconv_1/depthwise_kernel", "shape": [3, 3, 1152, 1], "dtype": "float32"}, {"name": "block7a_bn_1/gamma", "shape": [1152], "dtype": "float32"}, {"name": "block7a_bn_1/beta", "shape": [1152], "dtype": "float32"}, {"name": "block7a_bn_1/moving_mean", "shape": [1152], "dtype": "float32"}, {"name": "block7a_bn_1/moving_variance", "shape": [1152], "dtype": "float32"}, {"name": "block7a_se_reduce_1/kernel", "shape": [1, 1, 1152, 48], "dtype": "float32"}, {"name": "block7a_se_reduce_1/bias", "shape": [48], "dtype": "float32"}, {"name": "block7a_se_expand_1/kernel", "shape": [1, 1, 48, 1152], "dtype": "float32"}, {"name": "block7a_se_expand_1/bias", "shape": [1152], "dtype": "float32"}, {"name": "block7a_project_conv_1/kernel", "shape": [1, 1, 1152, 320], "dtype": "float32"}, {"name": "block7a_project_bn_1/gamma", "shape": [320], "dtype": "float32"}, {"name": "block7a_project_bn_1/beta", "shape": [320], "dtype": "float32"}, {"name": "block7a_project_bn_1/moving_mean", "shape": [320], "dtype": "float32"}, {"name": "block7a_project_bn_1/moving_variance", "shape": [320], "dtype": "float32"}, {"name": "block7b_expand_conv_1/kernel", "shape": [1, 1, 320, 1920], "dtype": "float32"}, {"name": "block7b_expand_bn_1/gamma", "shape": [1920], "dtype": "float32"}, {"name": "block7b_expand_bn_1/beta", "shape": [1920], "dtype": "float32"}, {"name": "block7b_expand_bn_1/moving_mean", "shape": [1920], "dtype": "float32"}, {"name": "block7b_expand_bn_1/moving_variance", "shape": [1920], "dtype": "float32"}, {"name": "block7b_dwconv_1/depthwise_kernel", "shape": [3, 3, 1920, 1], "dtype": "float32"}, {"name": "block7b_bn_1/gamma", "shape": [1920], "dtype": "float32"}, {"name": "block7b_bn_1/beta", "shape": [1920], "dtype": "float32"}, {"name": "block7b_bn_1/moving_mean", "shape": [1920], "dtype": "float32"}, {"name": "block7b_bn_1/moving_variance", "shape": [1920], "dtype": "float32"}, {"name": "block7b_se_reduce_1/kernel", "shape": [1, 1, 1920, 80], "dtype": "float32"}, {"name": "block7b_se_reduce_1/bias", "shape": [80], "dtype": "float32"}, {"name": "block7b_se_expand_1/kernel", "shape": [1, 1, 80, 1920], "dtype": "float32"}, {"name": "block7b_se_expand_1/bias", "shape": [1920], "dtype": "float32"}, {"name": "block7b_project_conv_1/kernel", "shape": [1, 1, 1920, 320], "dtype": "float32"}, {"name": "block7b_project_bn_1/gamma", "shape": [320], "dtype": "float32"}, {"name": "block7b_project_bn_1/beta", "shape": [320], "dtype": "float32"}, {"name": "block7b_project_bn_1/moving_mean", "shape": [320], "dtype": "float32"}, {"name": "block7b_project_bn_1/moving_variance", "shape": [320], "dtype": "float32"}, {"name": "top_conv_1/kernel", "shape": [1, 1, 320, 1280], "dtype": "float32"}, {"name": "top_bn_1/gamma", "shape": [1280], "dtype": "float32"}, {"name": "top_bn_1/beta", "shape": [1280], "dtype": "float32"}, {"name": "top_bn_1/moving_mean", "shape": [1280], "dtype": "float32"}, {"name": "top_bn_1/moving_variance", "shape": [1280], "dtype": "float32"}, {"name": "decoder_stage0a_conv_1/kernel", "shape": [3, 3, 1952, 256], "dtype": "float32"}, {"name": "decoder_stage0a_bn_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "decoder_stage0a_bn_1/beta", "shape": [256], "dtype": "float32"}, {"name": "decoder_stage0a_bn_1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "decoder_stage0a_bn_1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "decoder_stage0b_conv_1/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "decoder_stage0b_bn_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "decoder_stage0b_bn_1/beta", "shape": [256], "dtype": "float32"}, {"name": "decoder_stage0b_bn_1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "decoder_stage0b_bn_1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "decoder_stage1a_conv_1/kernel", "shape": [3, 3, 496, 128], "dtype": "float32"}, {"name": "decoder_stage1a_bn_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "decoder_stage1a_bn_1/beta", "shape": [128], "dtype": "float32"}, {"name": "decoder_stage1a_bn_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "decoder_stage1a_bn_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "decoder_stage1b_conv_1/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "decoder_stage1b_bn_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "decoder_stage1b_bn_1/beta", "shape": [128], "dtype": "float32"}, {"name": "decoder_stage1b_bn_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "decoder_stage1b_bn_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "decoder_stage2a_conv_1/kernel", "shape": [3, 3, 272, 64], "dtype": "float32"}, {"name": "decoder_stage2a_bn_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "decoder_stage2a_bn_1/beta", "shape": [64], "dtype": "float32"}, {"name": "decoder_stage2a_bn_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "decoder_stage2a_bn_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "decoder_stage2b_conv_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "decoder_stage2b_bn_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "decoder_stage2b_bn_1/beta", "shape": [64], "dtype": "float32"}, {"name": "decoder_stage2b_bn_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "decoder_stage2b_bn_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "decoder_stage3a_conv_1/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "decoder_stage3a_bn_1/gamma", "shape": [32], "dtype": "float32"}, {"name": "decoder_stage3a_bn_1/beta", "shape": [32], "dtype": "float32"}, {"name": "decoder_stage3a_bn_1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "decoder_stage3a_bn_1/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "decoder_stage3b_conv_1/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "decoder_stage3b_bn_1/gamma", "shape": [32], "dtype": "float32"}, {"name": "decoder_stage3b_bn_1/beta", "shape": [32], "dtype": "float32"}, {"name": "decoder_stage3b_bn_1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "decoder_stage3b_bn_1/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "decoder_stage4a_conv_1/kernel", "shape": [3, 3, 32, 16], "dtype": "float32"}, {"name": "decoder_stage4a_bn_1/gamma", "shape": [16], "dtype": "float32"}, {"name": "decoder_stage4a_bn_1/beta", "shape": [16], "dtype": "float32"}, {"name": "decoder_stage4a_bn_1/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "decoder_stage4a_bn_1/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "decoder_stage4b_conv_1/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "decoder_stage4b_bn_1/gamma", "shape": [16], "dtype": "float32"}, {"name": "decoder_stage4b_bn_1/beta", "shape": [16], "dtype": "float32"}, {"name": "decoder_stage4b_bn_1/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "decoder_stage4b_bn_1/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "final_conv_1/kernel", "shape": [3, 3, 16, 7], "dtype": "float32"}, {"name": "final_conv_1/bias", "shape": [7], "dtype": "float32"}]}]}